# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [18]:
df_babynames = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
df_babynames.head(5)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [19]:
df_babynames.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [21]:
#Buscando en google delete column of pandas dataframey, yo he intentado esto:
#df_babynames.drop["Unnamed:0","id"]
#Primer link encontrado esto: Por lo tanto lo aplico a ver si funciona
#del df["a"]
del df_babynames["Id"]

### Step 6. Is there more male or female names in the dataset?

In [27]:
df_babynames.groupby(by="Gender").count()

        Unnamed: 0    Name    Year   State   Count
Gender
F           558846  558846  558846  558846  558846
M           457549  457549  457549  457549  457549

### Step 7. Group the dataset by name and assign to names

In [54]:
dfnames=df_babynames.groupby("Name").count()
dfnames.head(5)

         Unnamed: 0  Year  Gender  State  Count
Name
Aaban             2     2       2      2      2
Aadan             4     4       4      4      4
Aadarsh           1     1       1      1      1
Aaden           196   196     196    196    196
Aadhav            1     1       1      1      1

In [65]:
#Dejar solo la columna de count no es problema con iloc
dfnames= dfnames.iloc[:,-1:]
#quiero ordenar, se que es la formula de sort = descending y por columna count pero no me acaba de salir solo, buscado por internet y encontrado esto:
#df.sort_values(by=['col1'])
dfnames = dfnames.sort_values(by=["Count"], ascending=False)
dfnames

          Count
Name
Riley      1112
Avery      1080
Jordan     1073
Peyton     1064
Hayden     1049
...         ...
Kayelynn      1
Kayelee       1
Kaydyn        1
Wendall       1
Nissen        1

[17632 rows x 1 columns]

### Step 8. How many different names exist in the dataset?

In [63]:
len(dfnames)

17632

### Step 9. What is the name with most occurrences?

In [64]:
dfnames.head(1)

       Count
Name
Riley   1112

### Step 10. How many different names have the least occurrences?

In [75]:
#Encontrar el valor minimo del df
valmin = dfnames.min()
valmin

Count    1
dtype: int64

In [79]:
#buscamos en internet filter df by column value pandas
#encontrado en primer link esto:
#rslt_df = dataframe[dataframe['Percentage'] > 70] 
len(dfnames[dfnames["Count"]==1])

3682

### Step 11. What is the median name occurrence?

In [84]:
#Esta la se de memoria
dfnames.Count.mean()

57.644906987295826

### Step 12. What is the standard deviation of names?

In [85]:
#Esta la se de memoria
dfnames.Count.std()

122.02996350814088

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [86]:
#Esta la se de memoria
dfnames.describe()

              Count
count  17632.000000
mean      57.644907
std      122.029964
min        1.000000
25%        2.000000
50%        8.000000
75%       39.000000
max     1112.000000